{
  "title": "Experiences",
  "experiences": [
    {
      "id": "0",
      "title": "Data Scientist",
      "compagny": "National Chiao Tung University",
      "compagny_categ": "Internship",
      "linkedin_url": "https://www.linkedin.com/school/national-chiao-tung-university/",
      "from": "June 2018",
      "to": "September 2018",
      "details": {
        "Subject: Detecting the Exercise Being Performed at the Gym from Data Recorded by Position Sensors on an Individual.": [
          "Analysis and understanding of coordinate data (x, y, z) over time.",
          "Utilization of Dynamic Time Warping (DTW) applied to each axis as a comparison criterion.",
          "Processing in python to implement an algorithm based on the different values found with the DTW method (pandas, numpy, dtw-python, scikit-learn)."
        ]
      },
      "stack": {
        "green": ["Python", "Machine Learning", "DTW (Dynamic Time Warping)"],
        "teal": ["Pandas", "Numpy"],
        "grey": ["Data Exploration", "Data Analysis"]
      }
    },
    {
      "id": "1",
      "title": "FullStack Developer / Data Analyst",
      "compagny": "T&E Vision",
      "compagny_categ": "Internship",
      "from": "April 2019",
      "to": "Aug 2019",
      "details": {
        "Creation of a web reporting MVP for data analysis in the Travel & Expense sector": [
          "Data exploration and processing with python (pandas, numpy).",
          "Creating a Web interface with an authentication system (HTML, JS, PHP).",
          "Allocation of a dedicated virtual machine connected to a DNS to bring the interface online."
        ]
      },
      "stack": {
        "green": ["Python", "HTML/JS", "PHP", "Tableau Desktop"],
        "teal": ["Pandas", "Numpy"],
        "grey": ["Data Analysis", "Web Development", "Deployment"]
      }
    },
    {
      "id": "2",
      "title": "FullStack Developer",
      "compagny": "Canton-Consulting",
      "compagny_categ": "FinTech",
      "linkedin_url": "https://www.linkedin.com/company/canton-consulting/",
      "from": "Sept 2019",
      "to": "Sept 2020",
      "details": {
        "Maintenance and updating of a web application for reporting and analyzing bank charges": [
          "Development of new connection information and account management features with an LDAP authentication system (Python dash, flask, python-ldap).",
          "Maintenance of CI/CD on our internal servers with GitHub CI/CD"
        ],
        "Installation and integration of an LDAP dedicated to various internal projects.": [
          "Understanding LDAP concepts, installation and security for different needs.",
          "Integration of LDAP as an authentication system for various projects (Python, JS)."
        ],
        "DPO (Data Protection Officer)": [
          "Verification that the use of internal project data complies with the GDPR."
        ],
        "Cleaning of a database for a client needs using python (regex, pandas, numpy)": []
      },
      "stack": {
        "green": ["Python","Linux","LDAP" ],
        "teal": ["Flask","Dash","Sqlalchemy","Pandas","Numpy"],
        "grey": ["Web development","Testing","CI/CD"]
      }
    },
    {
      "id": "3",
      "title": "Data Engineer / Back-End Developer",
      "compagny": "Mobsuccess",
      "compagny_categ": "Adtech",
      "linkedin_url": "https://www.linkedin.com/company/canton-consulting/",
      "from": "April 2021",
      "to": "Present",
      "details": {
        "Development of an internal API to share data with Back-End and Front-End teams": [
            "Usage of the Python library AWS Chalice to set up a web structure with AWS Lambda and API Gateway.",
            "Designed blueprints and services to accommodate diverse needs.",
            "Implemented adapters to validate input and output parameter types using decorators."
        ],
        "Setup, development, and maintenance of an MWAA (Airflow) instance on AWS": [
            "Development of an Airflow stack with AWS CloudFormation and SAM.",
            "Creation of bash scripts and CI/CD to automate the deployment of the stack.",
            "Implementation of DAGs to orchestrate various data jobs (DBT, EMR).",
            "Development of scripts to import internal data from various APIs (Facebook Ads, Google Ads, etc.)."
        ],
        "Creation and deployment of internal packages to interact with Facebook Ads and Google Ads libraries": [
            "Development of packages following Python standards to host them on AWS CodeArtifact.",
            "Establishment of CI/CD to automate deployment and testing."
        ],
        "Development of Spark jobs to set up data pipelines on AWS EMR": [
            "Creation of scripts with Pyspark to meet various data processing needs.",
            "Use of EMR Studio and CloudWatch for development."
        ],
        "Creation and deployment of AWS Lambdas for internal needs with SAM": [
          "In the MWAA stack, deployed a Lambda function to fetch an authentication token from AWS CodeArtifact and save it for MWAA integration every 10 hours due to token expiration.",
          "Creating a Lambda function to delete data older than 3 months containing personal information in order to comply with GDPR requirements."
        ]
    }
    ,
      "stack": {
        "green": ["AWS (Amazon Web Service)", "Python"],
        "teal": ["Airflow", "AWS Chalice", "Pyspark" ],
        "grey": ["Microservice", "DevOps", "Data engineering", "API REST", "Packaging"]
      }
    }
  ]
}