{ "experiences": [
    {
        "id":"1",
        "title": "FullStack Developer",
        "compagny": "T&E Vision",
        "compagny_categ": "",
        "from": "April 2019",
        "to": "Aug 2019",
        "details" : {
          "": ["Data Exploration and processing with Python (Pandas, Numpy, Plotly).",
                "Creation of a Web Interface using HTML, CSS, JS and PHP.",
                "Deployement the application on a virtual machine on OVH. Handle domain name and server connection."]
        }
    },
    {
        "id":"2",
        "title": "FullStack Developer",
        "compagny": "Canton-Consulting",
        "compagny_categ": "FinTech",
        "linkedin_url":"https://www.linkedin.com/company/canton-consulting/",
        "from": "Sept 2019",
        "to": "Sept 2020",
        "details" : {
        "":[
            "Implementation and integration of a LDAP used as authentication on different projects.(Python, JS).",
            "Development new features on a web reporting Dashboard with python Flask and Dash.",
            "Implementation Shell scripts in order to perform Continuous Integration and Deployment of a Flask application."
        ]
        }
    },{
        "id":"3",
        "title": "Data Engineer / Back-End Developer",
        "compagny": "Mobsuccess",
        "compagny_categ": "Adtech",
        "linkedin_url":"https://www.linkedin.com/company/canton-consulting/",
        "from": "April 2021",
        "to": "Present",
        "details" : {
          "Implementation of data pipelines to extract, process and import daily large amount of data from different sources.": [
          "Development python scripts orchestrated with MWAA in order to store data from advertising platforms into a Datalake.",
          "Creation of ETL with AWS Athena queries and Python Script triggered with MWAA in order to create a data Warehouse.",
          "Database management with AWS S3 using partitions in order to make each Airflow job idempotent and optimised for querying."
          ],
        "Deployement of python application in order to make easy access for internal data.": [
          "Deployement internal python package on AWS CodeArtifact in order to interact with APIs from different advertising's platform (google-ads, Facebook Buisness, Waze Ads).",
          "Development and deployement a REST Api on AWS lambda with Chalice in order to retrieve data for a front-end web dashboard."
          ]
        }
    }
]
}
