{ "experiences": [
        {
            "id":"1",
            "title": "Développeur FullStack",
            "compagny": "T&E Vision",
            "compagny_categ": "",
            "from": "Avril 2019",
            "to": "Aout 2019",
            "details" : {
            "": ["Exploration et traitement de données avec Python (Pandas, Numpy, Plotly).",
                    "Création d'une interface web en utilisant HTML, CSS, JS et PHP.",
                    "Déploiement de l'application sur une machine virtuelle sur OVH. Gestion du domaine et de la connexion au serveur."]
            }
        },
        {
            "id":"2",
            "title": "Développeur FullStack",
            "compagny": "Canton-Consulting",
            "compagny_categ": "FinTech",
            "linkedin_url":"https://www.linkedin.com/company/canton-consulting/",
            "from": "Sept 2019",
            "to": "Sept 2020",
            "details" : {
            "":[
                "Implémentation et intégration d'un LDAP utilisé comme authentification sur différents projets (Python, JS).",
                "Développement de nouvelles fonctionnalités outil de reporting web fonctionnant avec python Flask et Dash.",
                "Implémentation de scripts Shell afin de réaliser l'intégration et le déploiement continues d'une application Flask."
            ]
            }
        },
        {
            "id":"3",
            "title": "Data Engineer / Back-End Developer",
            "compagny": "Mobsuccess",
            "compagny_categ": "Adtech",
            "linkedin_url":"https://www.linkedin.com/company/canton-consulting/",
            "from": "April 2021",
            "to": "Present",
            "details" : {
            "Mise en œuvre de pipelines de données pour extraire, traiter et importer quotidiennement de grandes quantités de données provenant de différentes sources.": [
                "Développement de scripts python orchestrés avec MWAA afin de stocker les données des plateformes publicitaires dans un Datalake.",
                "Création d'ETL avec des requêtes AWS Athena et des scripts Python déclenchés avec MWAA afin de créer un entrepôt de données.",
                "Gestion de base de données avec AWS S3 en utilisant des partitions afin de rendre chaque tâche Airflow idempotente et optimisée pour les requêtes."
            ],
            "Déploiement d'une application python afin de faciliter l'accès aux données internes.": [
                "Déploiement d'un package python interne sur AWS CodeArtifact afin d'interagir avec les API de différentes plateformes publicitaires (google-ads, Facebook Buisness, Waze Ads).",
                "Développement et déploiement d'une Api REST sur AWS lambda avec Chalice afin de récupérer des données pour le front end d'un tableau de bord web."
            ]
            }
        }
    ]
}